Fix issues with starlight style (#166)
